def default_state():
    state = dict(user_action=[],
                 system_action=[],
                 belief_state={},
                 cur_domain=None,
                 askfor_slots=[],
                 askforsure_slotvs=[],
                 terminated=False,
                 history=[])
    state['belief_state'] = {
        '基本信息': {
            '现状': [
                {'身高': '', '体重': '', '年龄': '', '性别': '', '既往史': ''}]},
        '问题': {
            '现状': [{'疾病': '', '症状': '', '症状部位': '', '持续时长': '', '血糖值': '', '时间': ''}],
            '解释': [{'疾病': '', '症状': '', '症状部位': '', '持续时长': '', '血糖值': '', '时间': ''}]},
        '饮食': {
            '现状': [{'饮食名': '', '时间': '', '饮食量': '', '成分': '', '成份量': '', '效果': ''}],
            '解释': [{'饮食名': '', '时间': '', '饮食量': '', '成分': '', '成份量': '', '效果': ''}],
            '建议': [{'饮食名': '', '时间': '', '饮食量': '', '成分': '', '成份量': '', '效果': ''}]},
        '运动': {
            '现状': [{'运动名': '', '频率': '', '时间': '', '持续时长': '', '强度': '', '效果': ''}],
            '解释': [{'运动名': '', '频率': '', '时间': '', '持续时长': '', '强度': '', '效果': ''}],
            '建议': [{'运动名': '', '频率': '', '时间': '', '持续时长': '', '强度': '', '效果': ''}]},
        '行为': {
            '现状': [{'行为名': '', '频率': '', '时间': '', '持续时长': '', '效果': ''}],
            '解释': [{'行为名': '', '频率': '', '时间': '', '持续时长': '', '效果': ''}],
            '建议': [{'行为名': '', '频率': '', '时间': '', '持续时长': '', '效果': ''}]},
        '治疗': {
            '现状': [{'药品': '', '用药量': '', '用药（治疗）频率': '', '时间': '', '持续时长': '', '适应症': '',
                      '药品类型': '', '治疗名': '', '部位': '', '检查项': '', '检查值': '', '效果': ''}],
            '解释': [{'药品': '', '用药量': '', '用药（治疗）频率': '', '时间': '', '持续时长': '', '适应症': '',
                      '药品类型': '', '治疗名': '', '部位': '', '检查项': '', '检查值': '', '效果': ''}],
            '建议': [{'药品': '', '用药量': '', '用药（治疗）频率': '', '时间': '', '持续时长': '', '适应症': '',
                      '药品类型': '', '治疗名': '', '部位': '', '检查项': '', '检查值': '', '效果': ''}]
        }
    }
    return state
